In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
#how many times specific number came 
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [14]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

## Applying our custom function

In [19]:
def times2(x):
    return x*2

In [21]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

## Applying times2 using lambda

In [24]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [26]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting the values

In [30]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [31]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [32]:
! git add Operations.ipynb
! git commit -m "21:46/04-06-2001"
! git push origin main

warning: LF will be replaced by CRLF in Pandas/Operations.ipynb.
The file will have its original line endings in your working directory

[main 46f591a] 21:46/04-06-2001
 1 file changed, 524 insertions(+)
 create mode 100644 Pandas/Operations.ipynb

git: 'pudh' is not a git command. See 'git --help'.

The most similar command is
	push